/*
 * Часть 1:
    - Создать базу
        - Создать сканер пространства на ресурсы
        - Механика сбора ресурсов
            -
        - Счетчик ресурсов
    - Создать юнитов
        - Механика подбора ресурса
    - Создать спавнер ресурсов
        - Создать 2 точки между которыми будут спавнится ресурсы
    - Создать сам ресурс
 * Часть 2:
 
 */

/*
 Когда дрон достиг ресурса он должен взять его себе
когда взял идет на базу
выгрузка ресурса
после 3 ресурсов новый дрон

создать хранилище ресурсов
 */
